In [27]:
import pandas as pd
import os

In [2]:
df= pd.read_json(('../../../Desktop/Location History.json'))

In [3]:
df.head(1).columns

Index(['locations'], dtype='object')

In [4]:
from pandas.io.json import json_normalize
import json

with open('../../../Desktop/Location History.json') as data_file:    
    data = json.load(data_file)

In [5]:
df1 = json_normalize(data,'locations',max_level=1,errors='ignore')

In [6]:
df1.isnull().sum()

timestampMs              0
latitudeE7               0
longitudeE7              0
accuracy                 6
activity            113533
velocity            162507
altitude            115204
verticalAccuracy    115204
heading             170146
dtype: int64

In [7]:
df2=df1[df1.columns[:4]]

In [18]:
df3=df2[df2['accuracy']> 10.0]

In [19]:
df3

          timestampMs  latitudeE7  longitudeE7  accuracy
0       1491528541000   225793856    884648179      43.0
1       1491528600000   225793611    884647954      28.0
2       1491528660000   225792924    884647709      38.0
3       1491528723000   225793439    884647695      49.0
4       1491528780000   225793607    884647688      29.0
...               ...         ...          ...       ...
200584  1573170681456   247510334    466516493      15.0
200585  1573170824400   247510334    466516493      15.0
200586  1573170923608   247510334    466516493      15.0
200587  1573170990371   247510334    466516493      15.0
200588  1573171479352   247510334    466516493      15.0

[164937 rows x 4 columns]

In [20]:
df3=df3.assign(timestamp=pd.to_datetime(df3['timestampMs'],unit='ms'))
#df3=df3.assign(latitude = df3['latitudeE7'].apply(lambda x: f"{str(x)[:2]}.{str(x)[2:]}"))
#df3=df3.assign(longitude = df3['longitudeE7'].apply(lambda x: f"{str(x)[:2]}.{str(x)[2:]}"))

df3

,timestampMs,latitudeE7,longitudeE7,accuracy,timestamp
0,1491528541000,225793856,884648179,43.0,2017-04-07 01:29:01.000
1,1491528600000,225793611,884647954,28.0,2017-04-07 01:30:00.000
2,1491528660000,225792924,884647709,38.0,2017-04-07 01:31:00.000
3,1491528723000,225793439,884647695,49.0,2017-04-07 01:32:03.000
4,1491528780000,225793607,884647688,29.0,2017-04-07 01:33:00.000
...,...,...,...,...,...
200584,1573170681456,247510334,466516493,15.0,2019-11-07 23:51:21.456
200585,1573170824400,247510334,466516493,15.0,2019-11-07 23:53:44.400
200586,1573170923608,247510334,466516493,15.0,2019-11-07 23:55:23.608
200587,1573170990371,247510334,466516493,15.0,2019-11-07 23:56:30.371
200588,1573171479352,247510334,466516493,15.0,2019-11-08 00:04:39.352

In [21]:
import gmaps

In [22]:
import gmaps.datasets

gmaps.configure(api_key="AIzaSyDOQCaCKRwRQq3ovoQLqe3ZedslHqR1bz4")

In [23]:
#df3=df3.rename(columns={'latitudeE7':'latitude','longitudeE7':'longitude'})
df3=df3.assign(latitude = df3['latitudeE7'].apply(lambda x: f"{str(x)[:2]}.{str(x)[2:]}"))
df3=df3.assign(longitude = df3['longitudeE7'].apply(lambda x: f"{str(x)[:2]}.{str(x)[2:]}"))
df4=df3[df3.columns[5:]]
df4=df4.astype(float)
df4

         latitude  longitude
0       22.579386  88.464818
1       22.579361  88.464795
2       22.579292  88.464771
3       22.579344  88.464770
4       22.579361  88.464769
...           ...        ...
200584  24.751033  46.651649
200585  24.751033  46.651649
200586  24.751033  46.651649
200587  24.751033  46.651649
200588  24.751033  46.651649

[164937 rows x 2 columns]

In [24]:
fig = gmaps.figure()
fig.add_layer(gmaps.heatmap_layer(df4))
fig

Figure(layout=FigureLayout(height='420px'))